[
  {
      "title": "Web Dashboard",
      "challenge": "This project was all about taking a mock up and bringing it to life - especially functionally.  With integration of Charts.JS and several new skills used to create a responsive page while bringing several different widgets to life.",
      "skill1": "<strong>Chart.JS -</strong> Created and implemented dynamic charts using Chart.JS.",
      "skill2": "<strong>JavaScript -</strong> Notification panel, alert box, autocomplete messaging box.",
      "skill3": "<strong>Local Storage -</strong> Saves timezone and preferences locally.",
      "skill4": "<strong>SASS -</strong> All CSS compiled with SASS.",
      "fullImage": "assets/dashboardmodaldesktop.jpg",
      "thumbnail": "<img src=\"assets/dashboard.png\" class=\"dashboard-image\" alt=\"A picture of a computer monitor featuring the web dashboard app\">",
      "class": "item-1",
      "githubLink": "https://github.com/JohnSkeen/Web-Dashboard",
      "liveLink": "https://johnskeen.github.io/Web-Dashboard/"
  },
  {
      "title": "Sass Style Guide",
      "challenge": "This project was an introduction to an important skillset, SASS.  The challenge was to take a given comp and recreate using many different SASS tools.",
      "skill1": "<strong>SASS -</strong> An introduction to the use of SASS CSS Precomiler.",
      "skill2": "<strong>SASS -</strong> Strong utilization of functions, mixins, placeholders, and variables.",
      "skill3": "<strong>CSS -</strong> Strong CSS skills used, including introduction to BEM style naming convention.",
      "skill4": "<strong>Grid -</strong> An introduction and use of CSS Grid to format style sheet.",
      "fullImage": "assets/circlesmodaldesktop.jpg",
      "thumbnail": "<svg class=\"circles\"><use xlink:href=\"#circles\"></use></svg>",
      "class": "item-2",
      "githubLink": "https://github.com/JohnSkeen/SASS-Style-Guide",
      "liveLink": "https://johnskeen.github.io/SASS-Style-Guide/"
  },
  {
      "title": "Nichiha Landing Page",
      "challenge": "Nichiha needed a landing page matching a comp provided by their Senior Graphic Designer that was responsive, fluid, and integrated with Salesforce's Pardot.",
      "skill1": "<strong>Pardot -</strong> Integration with Salesforce's Pardot to capture leads for Nichiha's event.",
      "skill2": "<strong>JavaScript -</strong> Created a modal for rules and enabled smooth scrolling effects.",
      "skill3": "<strong>Responsive Design -</strong> Ensured that all elements were responsive to any screen size.",
      "skill4": "<strong>Client Communication -</strong> Worked with client to ensure all expectations were met and exceeded.",
      "fullImage": "assets/nichihamodaldesktop.jpg",
      "thumbnail": "<svg class=\"tickets-svg\"><use xlink:href=\"#tickets-svg\"></use></svg>",
      "class": "item-3",
      "githubLink": "https://github.com/JohnSkeen/Nichiha-landing-page-aia",
      "liveLink": "http://www2.nichiha.com/aia18-ticket-giveaway"
  },
  {
      "title": "Employee Directory",
      "challenge": "This project was my foray into the world of fetch.  The task at hand was to connect with Randomuser.me and pull down 12 random users.  From there you can see their information and click into each user for additional information.",
      "skill1": "<strong>JavaScript -</strong> Fetches API and allows for information to be randomly generated.",
      "skill2": "<strong>JavaScript -</strong> Search function created to allow user to find specific employees.",
      "skill3": "<strong>JavaScript -</strong> After clicking an employee a modal appears with additonal information",
      "skill4": "<strong>JavaScript -</strong> Arrows on right and left of modal scroll through employees.",
      "fullImage": "assets/directorymodaldesktop.jpg",
      "thumbnail": "",
      "class": "item-4",
      "githubLink": "https://github.com/JohnSkeen/Employee-Directory",
      "liveLink": "https://johnskeen.github.io/Employee-Directory/"
  },
  {
      "title": "Game Show App",
      "challenge": "Creating a web game using JavaScript was a lot of fun!  I especially enjoyed adding small details like the CSS animated flip of the letters.  See if you can solve one or two!",
      "skill1": "<strong>JavaScript -</strong> Upon loading the program chooses randomly from 5 phrases.",
      "skill2": "<strong>JavaScript -</strong> Game has functionality to reset and start over again after a win or loss.",
      "skill3": "<strong>JavaScript -</strong> Functionality created to show letters or to lose score when selecting letters below",
      "skill4": "<strong>CSS -</strong> Created strong and compelling CSS animation for letter flipping.",
      "fullImage": "assets/wheelmodaldesktop.jpg",
      "thumbnail": "",
      "class": "item-5",
      "githubLink": "https://github.com/JohnSkeen/Wheel-of-Success",
      "liveLink": "https://johnskeen.github.io/Wheel-of-Success/"
  }
]
